Connect to the database using credentials below:

    host: mid-term-project.ca2jkepgjpne.us-east-2.rds.amazonaws.com
    port: 5432
    user: lhl_student
    pwd: lhl_student
    database: mid_term_project

The database contains all tables we need for the mid-term project.

In [5]:
import pandas as pd
import numpy as np

In [2]:
import psycopg2

# Connect to your postgres DB
conn = psycopg2.connect(host = 'mid-term-project.ca2jkepgjpne.us-east-2.rds.amazonaws.com',
                       port = '5432',
                       user = 'lhl_student',
                       password = 'lhl_student',
                       database = 'mid_term_project')

# Open a cursor to perform database operations
cur = conn.cursor()

In [35]:
pd.read_sql("SELECT DISTINCT fl_date FROM flights ORDER BY fl_date DESC"
            ,conn)

        fl_date
0    2019-12-31
1    2019-12-30
2    2019-12-29
3    2019-12-28
4    2019-12-27
..          ...
725  2018-01-05
726  2018-01-04
727  2018-01-03
728  2018-01-02
729  2018-01-01

[730 rows x 1 columns]

Selecting flights from the following ranges: <br>
(January 1, 2018 - January 15th, 2018)<br>
(December 15, 2018 - January 15, 2019) <br>
(December 15, 2019 - December 31, 2019)

These values are likely to by the most representative of the test set, as they are dates that bound the holiday period, where flight habits are most likely to change for many people.  Could potentially extend it to other holidays important American holidays such as thanksgiving or July 4th.

In [ ]:
flight_data = pd.read_sql("SELECT * FROM flights WHERE (fl_date BETWEEN '2018-12-15'AND '2019-01-15') OR (fl_date BETWEEN '2018-01-01' AND '2018-01-15') OR (fl_date BETWEEN '2019-12-15' AND '2019-12-31')"
            ,conn)

In [ ]:
flight_data